// Написать программу, которое выводит случайное число из отрезка [10,99] и показывает наибольшую цифру числа.
// 78 -> 8
// 12 -> 2
// 85 -> 8
// Random rnd = new Random();

int n = new Random().Next(10, 100); 
System.Console.WriteLine(n);

